cfd/cfd-master-hcmut/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          208;
        startFace       320347;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32002;
        startFace       320555;
    }
    outlet_33
    {
        type            patch;
        nFaces          68;
        startFace       352557;
    }
    outlet_43
    {
        type            patch;
        nFaces          208;
        startFace       352625;
    }
    outlet_53
    {
        type            patch;
        nFaces          208;
        startFace       352833;
    }
)

// ************************************************************************* //
