cfd/cfd-master-hcmut/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.0233333333;
        value           uniform (0 0 0);
    }
    wall
    {
        type            noSlip;
    }
    outlet_33
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    outlet_43
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    outlet_53
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}
