cfd/cfd-master-hcmut/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    outlet_33
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet_43
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet_53
    {
        type            fixedValue;
        value           uniform 0;
    }
}