cfd/cfd-master-hcmut/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\    /   A nd         | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-06;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }

    outlet_33
    {
        type            zeroGradient;
    }

    outlet_43
    {
        type            zeroGradient;
    }

    outlet_53
    {
        type            zeroGradient;
    }
}