cfd/cfd-master-hcmut/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O   peration     | Version:  2312                                  |
|   \\    /   A nd         | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    outlet_33
    {
        type            calculated;
        value           uniform 0;
    }

    outlet_43
    {
        type            calculated;
        value           uniform 0;
    }

    outlet_53
    {
        type            calculated;
        value           uniform 0;
    }
}