cfd/cfd-master-hcmut/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{

    p
    {
            
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-8;
    relTol 	         1e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        // minIter         2;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
    }

    epsilon
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
    }

    "(U|cellDisplacement)"
    {
        $U;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;

    // Convergence criteria
    residualControl
    {
        p               1e-4; 
        U               1e-5;
        
        // Turbulence fields
        k               1e-5;
        epsilon         1e-5;
        // omega           1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
